Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གནས་བརྟན་གང་དག་རྒས་པ་དང་། །རྒས་ཤིང་འཁོགས་པ་གཏུགས་པ་དག །
en: “ ‘Elders’ who are merely old, ‘Elders’ who are just aged and decrepit,

source: དགྲ་བཅོམ་བསོད་སྙོམས་ཟོས་གྱུར་ནས། །སེམས་ཅན་དམྱལ་བར་མྱུར་དུ་འགྲོ། །
en: Enjoy offerings befitting an arhat, But then they fall straight into hell.

source: དེ་དག་ཚུལ་ཁྲིམས་རབ་དཀོན་ན། །དགྲ་བཅོམ་པར་ལྟ་ག་ལ་འགྱུར། །
en: “Being a moral person is rare enough, Not to mention becoming an arhat.

source: དད་པས་མཆོད་རྟེན་བྱེད་འགྱུར་ཏེ། །དེ་དག་ངན་འགྲོ་རྣམས་སུ་འགྲོ །
en: One may express faith in constructing a stūpa And still go to the lower realms.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ཚུལ་ཁྲིམས་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་དོན་གྱི་ཕྱིར་སློབ་དཔོན་ལ་བསྙེན་བཀུར་དང་། །རིམ་གྲོ་བྱེད་པ་ནི་འདི་འདྲ་བའི་ཕན་ཡོན་དེ་དག་དང་། །དེ་བས་ཀྱང་ལྷག་པ་དཔག་ཏུ་མེད། ། བསམ་གྱི་མི་ཁྱབ། ། ཚད་མེད་པ་འཐོབ་པར་འགྱུར་རོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་དབང་དུ་གྱུར་པ། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། །
en: “Śāriputra, the bodhisatva who practices morality in this way will honor and serve his teacher for the sake of The Collected Teachings on the Bodhisatva, and he will obtain these sorts of benefits and benefits that are even greater than these—that are unlimited, inconceivable and immeasurable. So it is, Śāriputra, that the bodhisatva who bases himself firmly on The Collected Teachings on the Bodhisatva values advice and keeps his morality completely pure when he practices the way of the bodhisatva.

source: དེ་ལ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། ཤཱ་རིའི་བུ་རྣམ་པ་བཅུས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱའོ། ། བཅུ་གང་ཞེ་ན། སེམས་ཅན་ཐམས་ཅད་ལ་མི་འཚེ་བ་ཡིན། གཞན་གྱི་རྫས་ལ་མི་རྐུ་བ་ཡིན། གཞན་གྱི་ཆུང་མ་སྤངས་པ་ཡིན། སེམས་ཅན་ཐམས་ཅད་ལ་མི་སླུ་བ་ཡིན། གཞན་གྱི་གཡོག་འཐུན་པ་ལ་ཕྲ་མ་མི་ཟེར་བ་ཡིན། ཚིག་དྲག་པོ་བཟོད་པའི་ཕྱིར་ངག་མི་རྩུབ་པ་ཡིན། ཚིག་བསྡམས་པས་ཚིག་འཁྱལ་པ་སྤངས་པ་ཡིན། གཞན་གྱི་ལོངས་སྤྱོད་ལ་ང་ཡིར་མི་འཛིན་པས་བརྣབ་སེམས་མེད་པ་ཡིན། ཚིག་ངན་པར་སྨྲས་པ་བཟོད་པས་གནོད་སེམས་སྤངས་པ་ཡིན། ལྷ་གཞན་མི་འདོད་པས་ལོག་པར་ལྟ་བ་སྤངས་པ་ཡིན་ཏེ། ཤཱ་རིའི་བུ་རྣམ་པ་བཅུ་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱའོ། །
en: “What does pure morality imply in this context? Śāriputra, the pure morality of the bodhisatva has ten features. What are these ten features? He does not hurt any sentient being. He does not steal the property of others. He does not desire another’s wife. He does not deceive any sentient being. He does not publicly slander people. He is patient when faced with abuse, and he does not use harsh language. He abstains from idle chatter, and instead he expresses himself coherently. He is not selfish, and so he does not covet others’ wealth. He can patiently endure slanderous speech and does not develop malice. He has no affinity for other gods, and so he is free from wrong views. These, Śāriputra, are the ten features of the pure morality of the bodhisatva.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་རྣམ་པ་བཅུས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱ་སྟེ། བཅུ་གང་ཞེ་ན། མི་ཤེས་པ་མི་འདོད་པས་མ་ཉམས་པའི་ཚུལ་ཁྲིམས་ཡིན། ངན་པར་སྐྱེ་བ་ཡོངས་སུ་སྤངས་པས་སྐྱོན་མེད་པའི་ཚུལ་ཁྲིམས་ཡིན། ཉོན་མོངས་པ་ཐམས་ཅད་དང་མ་འདྲེས་པས་འདྲེན་མ་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་ཡིན། གཅིག་ཏུ་དཀར་པོའི་ཆོས་རྣམ་པར་སྤེལ་བས་སྲ་སྲེ་མེད་པའི་ཚུལ་ཁྲིམས་ཡིན། ཇི་ལྟར་འདོད་པ་བཞིན་དུ་འགྲོ་བས་རང་དབང་གི་ཚུལ་ཁྲིམས་ཡིན། མཁས་པས་མ་སྨད་པས་བསྔགས་པའི་ཚུལ་ཁྲིམས་ཡིན། ཉེས་པ་ཐམས་ཅད་མི་སྒྲུབ་པས་མ་སྨད་པའི་ཚུལ་ཁྲིམས་ཡིན། དབང་པོ་བསྲུངས་པས་ཤིན་ཏུ་སྦས་པའི་ཚུལ་ཁྲིམས་ཡིན། དྲན་པ་དང་། ཤེས་བཞིན་གྱི་ཕྱིར་ཤིན་ཏུ་བསྲུངས་པའི་ཚུལ་ཁྲིམས་ཡིན་ཏེ། ཤཱ་རིའི་བུ་རྣམ་པ་བཅུ་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱའོ། །
en: “Śāriputra, there is a further set of ten features of pure morality of the bodhisatva. What are these ten features? He is not attracted to the ignorant, and so his morality does not become impaired. He avoids disadvantageous rebirths, and so his morality does not become broken. He does not become entangled in any disturbing emotions, and so his morality does not become muddled. He is only concerned with strengthening positive qualities, and so his morality remains unsullied. He follows his own instincts, and so his morality remains free. There is nothing for which the wise can criticize him, and so he maintains his reputation for moral purity. He abstains from pursuing any vices, and so his morality remains blameless. He controls his senses, guarding his morality well. He is attentive and mindful, guarding his morality superbly. These, Śāriputra, are ten further features of the pure morality of the bodhisatva.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་རྣམ་པ་བཅུས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱ་སྟེ། བཅུ་གང་ཞེ་ན། རུང་བའི་ཚོད་ཤེས་པས་འདོད་པ་ཉུང་བའི་ཚུལ་ཁྲིམས་ཡིན། འདོད་པ་སྤོང་བས་ཆོག་ཤེས་པའི་ཚུལ་ཁྲིམས་ཡིན། ལུས་དང་སེམས་རབ་ཏུ་དབེན་པས་ནན་ཏན་གྱི་ཚུལ་ཁྲིམས་ཡིན། འདུ་འཛི་ལ་སྨོད་པས་དགོན་པར་གནས་པའི་ཚུལ་ཁྲིམས་ཡིན། བདག་གི་ཁར་ལས་པའི་དགེ་བའི་རྩ་བ་བསྒྲུབ་པའི་ཕྱིར་སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པའི་ཚུལ་ཁྲིམས་ཡིན། ཕ་རོལ་གྱི་གདོང་དུ་མི་ལྟ་བས་འཕགས་པའི་རིགས་ལ་དགའ་བའི་ཚུལ་ཁྲིམས་ཡིན། ལྷ་དང་མི་རྣམས་ལ་མི་སླུ་བས་ཇི་ལྟར་སྨྲས་པ་དེ་ལྟར་བྱེད་པའི་ཚུལ་ཁྲིམས་ཡིན། རང་གི་སེམས་ངེས་པར་རྟོག་པས་བདག་གི་འཁྲུལ་པ་ལ་སོ་སོར་རྟོག་པའི་ཚུལ་ཁྲིམས་ཡིན། ཕ་རོལ་གྱི་སེམས་སྲུང་བས་གཞན་གྱི་འཁྲུལ་པ་ལ་ཉེས་པར་མི་ལྟ་བའི་ཚུལ་ཁྲིམས་ཡིན། བསྡུ་བའི་དངོས་པོ་རྗེས་སུ་མི་གཏོང་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཚུལ་ཁྲིམས་ཡིན་ཏེ། ཤཱ་རིའི་བུ་རྣམ་པ་བཅུ་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱའོ། །
en: “Śāriputra, there is a further set of ten features of pure morality of the bodhisatva. What are these ten features? As he knows what the appropriate limits are, he maintains the morality of moderation. As he has overcome desire, he maintains the morality of contentment. As he keeps his body and mind in remote places, he maintains the morality of perseverance. As he despises involvement with worldly matters, he maintains the morality of dwelling in the wilderness. As he is self-reliant in developing roots of virtue, he maintains the morality of ascetic practices and abstinence. As he does not stare at people’s faces, he maintains the morality of delighting in the lineage of the noble ones. As he does not break his promises to gods or men, he maintains the morality of acting in accord with his words. As he is focused on his own mind, he maintains the morality of being aware of his own inadequacies. As he is considerate of the minds of others, he does not think badly of others’ inadequacies. As he does not abandon the methods for bringing people together, he maintains the morality of bringing sentient beings to maturity. These, Śāriputra, are ten further features of the pure morality of the bodhisatva.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་རྣམ་པ་བཅུས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱ་སྟེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཐ་བའི་སེམས་མེད་པས་སངས་རྒྱས་ལ་དད་པའི་ཚུལ་ཁྲིམས་ཡིན། དམ་པའི་ཆོས་སྲུང་བས་ཆོས་ལ་དད་པའི་ཚུལ་ཁྲིམས་ཡིན། འཕགས་པ་འདུས་པ་ལ་གུས་པས་དགེ་འདུན་ལ་དད་པའི་ཚུལ་ཁྲིམས་ཡིན། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ལ་བྱེད་པ་དང་མ་བྲལ་བས་འདུད་པའི་ཚུལ་ཁྲིམས་ཡིན། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཚོགས་བསགས་པས་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པའི་ཚུལ་ཁྲིམས་ཡིན། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པས་སྡིག་པའི་གྲོགས་པོ་ཡོངས་སུ་སྤོང་བའི་ཚུལ་ཁྲིམས་ཡིན། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་བྱམས་པའི་ཚུལ་ཁྲིམས་ཡིན། ཉམ་ཐག་པར་གྱུར་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་སྙིང་རྗེའི་ཚུལ་ཁྲིམས་ཡིན། ཆོས་ལ་དགའ་ཞིང་རབ་ཏུ་མོས་པས་དགའ་བའི་ཚུལ་ཁྲིམས་ཡིན། རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤངས་པས་བཏང་སྙོམས་ཀྱི་ཚུལ་ཁྲིམས་ཡིན་ཏེ། ཤཱ་རིའི་བུ་རྣམ་པ་བཅུ་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱའོ། །
en: “Śāriputra, there is a further set of ten features of pure morality of the bodhisatva. What are these ten features? As his mind is not jaded, he maintains the morality of having faith in the Buddha. As he defends the authentic teaching, he maintains the morality of having faith in the Dharma. As he has reverence for the noble assembly, he maintains the morality of having faith in the Saṅgha. As he always keeps his mind directed toward the buddhas and bodhisatvas, he maintains the morality of homage and veneration. As he develops the necessary factors of awakening, he maintains the morality of relying upon a spiritual friend. As he has abandoned all unwholesome forms of conduct, he upholds the morality of ridding oneself of negative influences. As he helps to bring all sentient beings to maturity, he upholds the morality of love. As he helps to bring pitiable sentient beings to maturity, he upholds the morality of compassion. As he enjoys and delights in the Dharma, he maintains the morality of empathetic joy. As he has rid himself of attachment and anger, he maintains the morality of equanimity. These, Śāriputra, are ten further features of the pure morality of the bodhisatva.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་རྣམ་པ་བཅུས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱ་སྟེ། བཅུ་གང་ཞེ་ན། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་སྦྱིན་པའི་ཚུལ་ཁྲིམས་ཡིན། སེམས་ཀུན་ཏུ་སྲུང་བས་བཟོད་པའི་ཚུལ་ཁྲིམས་ཡིན། མི་ཟློགས་པས་བརྩོན་འགྲུས་ཀྱི་ཚུལ་ཁྲིམས་ཡིན། བསམ་གཏན་གྱི་ཚོགས་ཡང་དག་པར་རྫོགས་པར་བྱེད་པས་བསམ་གཏན་གྱི་ཚུལ་ཁྲིམས་ཡིན། ཐོས་པ་དང་ཚུལ་ཁྲིམས་ཀྱིས་མི་ངོམས་པས་ཤེས་རབ་ཀྱི་ཚུལ་ཁྲིམས་ཡིན། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཡོངས་སུ་ཚོལ་བས་ཐོས་པ་ཡོངས་སུ་ཚོལ་བའི་ཚུལ་ཁྲིམས་ཡིན། མི་རྟག་པའི་འདུ་ཤེས་སོ་སོར་རྟོག་པས་ལུས་ལ་མི་ལྟ་བའི་ཚུལ་ཁྲིམས་ཡིན། སེམས་ལ་སྒྱུ་མ་ལྟ་བུར་སོ་སོར་རྟོག་པས་སྲོག་ལ་ཡིད་མི་རྟོན་པའི་ཚུལ་ཁྲིམས་ཡིན། ཐོག་མ་ནས་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པས་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་ཚུལ་ཁྲིམས་ཡིན། ཚུལ་ཁྲིམས་ཐམས་ཅད་ཡོངས་སུ་བསྔོ་བས་དེ་བཞིན་གཤེགས་པ་དང་ཕྲད་པའི་ཚུལ་ཁྲིམས་ཡིན་ཏེ། ཤྭ་རིའི་བུ་རྣམ་པ་བཅུ་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རིག་པར་བྱའོ། །
en: “Śāriputra, there is a further set of ten features of pure morality of the bodhisatva. What are these ten features? As he helps to bring sentient beings to maturity, he maintains the morality of generosity. As he guards his mind, he maintains the morality of patience. As he does not give up, he maintains the morality of vigor. As he perfects the requirements for meditation, he maintains the morality of meditation. As his thirst for learning about what is fundamental is insatiable, he maintains the morality of wisdom. As he studies The Collected Teachings on the Bodhisatva, he maintains the morality of pursuing learning. As he keeps impermanence in mind, he maintains the morality of having no concern for the body. As he maintains an understanding that the mind is like an illusion, he maintains the morality of not trusting in a life force. As his morality is completely pure from the outset, he maintains the morality that is the fulfillment of all intentions. As he dedicates all his morality to awakening, he maintains the morality that connects one with the tathāgatas. These, Śāriputra, are ten further features of the pure morality of the bodhisatva.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ཚུལ་ཁྲིམས་ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔས་ལྷ་དང་མིའི་དཔལ་ཕུན་སུམ་ཚོགས་པར་མྱོང་བར་མི་འགྱུར་བ་གང་ཡང་མེད་དོ། ། འཇིག་རྟེན་གྱི་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་མི་ཤེས་པ་གང་ཡང་མེད་དེ། དེས་སེམས་ཅན་ཐམས་ཅད་ལོངས་སྤྱོད་དང་། ཉེ་བར་སྤྱོད་པ་ཐོབ་པར་མི་བྱེད་པ་གང་ཡང་མེད་དོ། ། སོ་སོའི་སྐྱེ་བོ་ཕན་ཚུན་མི་མཛའ་བར་མི་འགྱུར་བ་དེ་གང་ཡང་མེད་དེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཁོང་ཁྲོ་བ་མེད་དོ། ། གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་མ་དད་པར་འགྱུར་བའི་བརྫུན་དུ་སྨྲ་བ་དེ་གང་ཡང་མེད་དོ། ། དེ་སེམས་ཅན་གང་ལ་ཡང་མར་འདུ་ཤེས་མི་སྐྱེད་པ་མེད་དོ། ། དེ་སེམས་ཅན་གྱི་རིས་ན་སེམས་ཅན་གང་ལ་ཡང་ཕར་འདུ་ཤེས་མི་སྐྱེད་པ་མེད་དོ། ། དེ་སེམས་ཅན་གང་ལ་ཡང་ཡིད་རྟོན་པའི་འདུ་ཤེས་མི་སྐྱེད་པ་མེད་དོ། ། དེ་འདུས་བྱས་ཀྱི་ཆོས་གང་ལ་ཡང་མི་རྟག་པར་འདུ་ཤེས་མི་སྐྱེད་པ་མེད་དོ། ། དེ་ཐམས་ཅད་འདུ་བྱེད་དུ་གཏོགས་པར་ཤེས་ནས་ལུས་དང་སྲོག་ལ་མི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། །
en: “Śāriputra, the morality of the bodhisatva is so completely pure that there is no divine or human glory that he does not experience. There is no worldly craft or skill that he does not master, and there are no pleasures or resources that sentient beings possess that he cannot attain. There is no way for ordinary people to come into conflict with him—the bodhisatva has no enmity. There is no liar that the bodhisatva does not relate to in good faith. There is no sentient being that he does not consider as having been his mother. There is no sentient being among the different kinds of beings who he does not consider as having been his father. There is no sentient being that will not place their trust in him. There are no conditioned phenomena that he does not consider to be impermanent. As he sees that this is the way of all conditioned things, the bodhisatva practices the way of the bodhisatva, keeping his morality pure with no concern for his body or his life.”

source: ཚུལ་ཁྲིམས་འདི་ལ་གང་གནས་པ། །སྐྱོབ་པ་ཡི་ནི་ཆོས་སྐུ་དང་། །དབྱངས་དང་ཁ་དོག་གཟུགས་རྣམས་ནི། །དེ་དག་ལ་ནི་རྙེད་མི་དཀའ། །
en: “The sound, the features, and the form Of the Dharma body of the protector Are not hard to obtain For those who practice morality.

source: མདོངས་ཤིང་དམུས་ལོང་མི་འགྱུར་ལ། །ཞར་སྒུར་ཞ་བར་མི་འགྱུར་རོ། །
en: “One will not become blind or deaf, Crippled or impaired in any way.

source: འབྱུང་བ་རྣམ་པར་དག་འགྱུར་ཞིང་། །དེ་ཡི་ལུས་ནི་མཛེས་པར་འགྱུར། །
en: One who has embarked on what is pure Will have a beautiful appearance.

source: སྟོབས་ཆེ་ཞིང་ནི་མཐུ་ཆེ་སྟེ། ། གཟི་ཆེ་ཞིང་ནི་གཟི་བརྗིད་རབ། །
en: “One will have great power, great strength, And one will shine with the greatest splendor.

source: ཤེས་རབ་དང་ནི་བརྩོན་འགྲུས་ཀྱིས། །སྡིག་ཅན་བདུད་ནི་སྐྲག་པར་བྱེད། །
en: One’s wisdom and vigor will be like that of Vāyuna, Arousing fear in the evil Māra.

source: རྒྱལ་པོ་ཡིས་ནི་མངོན་མཆོད་ཅིང་། །ལྷ་ཀླུ་རྣམས་ཀྱིས་བཀུར་སྟི་བྱས། ། ཐེ་ཚོམ་ཐམས་ཅད་ཆད་པར་འགྱུར། །དེ་དག་བྱམས་པ་ཤིན་ཏུ་བསྒོམས། །
en: “Worshiped by kings, Honored by gods and nāgas, They eliminate all doubt And excel in the practice of love.

source: ཚུལ་ཁྲིམས་ཕུང་པོར་རབ་གནས་ནས། །གསོད་པར་བྱེད་ཀྱང་འཇིགས་པ་མེད། །
en: “They master the field of morality And do not fear dying.

source: གྲགས་པ་ཆེན་པོ་ཆོས་སྤྱོད་པ། །ངན་འགྲོ་དག་ཏུ་མི་འགྲོའོ། །
en: Religious practitioners of great renown Will not go to the lower realms.

source: སེམས་ཅན་ཐམས་ཅད་གཉིད་ལོག་ཀྱང་། །སྙོམ་པ་མེད་ཅིང་མི་ཉལ་ཏེ། །
en: “Even in their sleep they watch over All sentient beings and never grow tired.

source: ཕྱོགས་བཞི་དག་ནི་ཀུན་ཏུ་ཡང་། །ལེགས་པར་བཤད་པ་ཡོངས་སུ་ཚོལ། །
en: They search in all four directions For genuine teachings.

source: ཚུལ་ཁྲིམས་ཕུང་པོར་གནས་པ་དག །རིན་ཆེན་མཆོག་དང་ཆུང་མ་དང་། །བདག་གི་ཤ་ཡང་རབ་གཏོང་ཞིང་། །བྱང་ཆུབ་ལམ་ནི་ཀུན་ཏུ་ཚོལ། །
en: “Those who master the field of morality Will give away the most precious riches, Their wives and their own flesh, In the search for the path of awakening.

source: སངས་རྒྱས་ཆོས་ནི་བླ་མེད་པ། །མཆོག་གི་ཆོས་རྣམས་ཡོངས་སུ་ཚོལ། །
en: “They search for the highest Dharma, The unsurpassed teachings of the Buddha.

source: འཇིག་རྟེན་དག་གི་མགོན་འགྱུར་ཞིང་། །མཆོད་རྟེན་དང་ནི་སྦྱིན་པར་འོས། །
en: They are lords of the world, Worthy recipients of veneration.

source: གཤེ་ཞིང་ཡོངས་སུ་སྤྱོ་བ་དང་། །ཉེས་པ་བྱས་པ་ཐམས་ཅད་བཟོད། །
en: “They put up with abuse, criticism, And all kinds of wicked behavior.

source: བཟོད་པ་ཉིད་ལ་རབ་གནས་ཤིང་། །བཟོད་པ་ཡི་ནི་བསྔགས་པ་རྗོད། །
en: They praise patience. They are masters of patience.

source: མི་བདེན་པར་ནི་མི་སྨྲ་སྟེ། ། ཇི་ལྟར་སྨྲས་པ་དེ་བཞིན་བྱེད། བྱང་ཆུབ་སྙིང་པོར་འདུག་ནས་ནི། །ས་འདི་དག་ཀྱང་གཡོ་བར་བྱེད། །
en: “They act as they speak. They do not speak falsely, And when they sit on the seat of awakening The earth shakes.

source: སངས་རྒྱས་ཆོས་ལ་ནེམ་ནུར་མེད། །ལྷ་གཞན་དག་ནི་རབ་ཏུ་སྤོང་། །རྟག་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་ལས། །ལྷ་གཞན་ཡོད་པར་མི་འགྱུར་རོ། །
en: “They do not doubt the Buddha’s teachings, And they dispense with other gods, Never holding anything to be more sacred Than the Buddha, the Lord.

source: མཚོན་དག་དང་ནི་དུག་རྣམས་ཀྱིས། །ཕན་ཚུན་གནོད་པར་བྱེད་པ་ཡི། །སྡུམས་ནི་བྱེད་པར་འགྱུར་བ་དག ། དེ་ནི་མཁས་པའི་མཚན་ཉིད་དོ། །
en: “The mark of a learned one Is that he reconciles those Who use weapons and poison To hurt one another.

source: སེམས་ཅན་སྡུག་བསྔལ་རྣམས་མཐོང་ན། །བསྐལ་པ་བྱེ་བ་མང་པོར་ཡང་། །བདག་གི་དོན་ནི་མེད་གྱུར་ཀྱང་། །ཡལ་བར་འདོར་བར་མི་འགྱུར་རོ། །
en: “He has no concern for his own welfare, And he will never abandon sentient beings Once he has seen their immense suffering, Even if he has to remain for thousands of millions of eons.

source: དོན་རྙེད་ན་ནི་མཛའ་བོ་ཞེས། །ཕན་ཚུན་དུ་ནི་རབ་ཏུ་སྨྲ། །
en: “Sentient beings relate to one another thinking, ‘I am friendly when it benefits me.’

source: དོན་ནི་བྱེད་པར་མ་གྱུར་ན། །
en: Then, when friendliness brings no benefit,

source: གཅིག་ལ་གཅིག་ནི་གསོད་པར་བྱེད། །
en: They do not hesitate to kill one another.

source: འཛམ་བུ་ཡི་ནི་གླིང་འདི་དང་། །སངས་རྒྱས་ཀྱི་ནི་ཞིང་ཀུན་ཏུ། །རིན་ཆེན་བཀང་སྟེ་སྦྱིན་བྱས་ནས། །
en: “ ‘I will fill the Jambu continent, And even the mighty buddha realms, With riches and give it to you—

source: རྟག་ཏུ་བདག་གི་གྲོགས་སུ་འགྱུར། །
en: You are my friend whatever happens.’

source: གང་དག་མཚོན་རྣམས་རྣོན་པོ་ཡིས། །ཡན་ལག་ཉིང་ལག་གཅོད་པ་ཡི། །སེམས་ཅན་དག་ནི་ཐམས་ཅད་ལ། །སེམས་ནི་མཉམ་པར་རབ་ཏུ་འཇུག །
en: “He remains even minded Toward all sentient beings, Even if his major and minor limbs Are severed with sharp weapons.

source: སངས་རྒྱས་དག་གི་ཆོས་རྣམས་ཕྱིར། །བྱིས་པ་རྣམས་ཀྱི་ཆོས་སྤོང་སྟེ། །
en: “For the sake of the Buddha’s teachings, They defeat the teachings of the immature.

source: ཆོས་ལ་ཤིན་ཏུ་གནས་གྱུར་པས། །ཚུལ་ཁྲིམས་རྟག་ཏུ་དག་པར་འགྱུར། །
en: They always maintain pure morality, And master the true Dharma.

source: ཆོས་ཀྱི་རྗེས་འཐུན་ཆོས་ཞུགས་ནས། ། བྱང་ཆུབ་ཀྱི་ནི་སྤྱད་པ་སྤྱོད། །
en: “They practice the way of awakening By engaging with the Dharma and with whatever is in accord with it.

source: སངས་རྒྱས་ཀྱི་ནི་བྱང་ཆུབ་ཕྱིར། །རིགས་གསུམ་བདུད་རྩི་རབ་ཏུ་སྦྱིན། །
en: In order to realize awakening, They will give up the nectar of threefold knowledge.

source: ཚུལ་ཁྲིམས་ཕུང་པོར་གནས་བྱས་ནས། །
en: “Remaining within the field of morality,

source: ཆོས་རྣམས་ཐམས་ཅད་མངོན་པར་བསླབས། །མཁས་པ་ལྷ་དང་བཅས་པ་ཡི། །འཇིག་རྟེན་ནི་མཆོད་པར་འོས། །
en: All the teachings become their training, And in the world with its gods The wise accord them honor.

source: ཆོས་རྣམས་ཀུན་ལ་ཐེ་ཚོམ་མེད། །
en: “They have no doubts whatsoever about the Dharma,

source: བཟོ་ཀུན་ལ་ཡང་རབ་ཏུ་མཁས། །
en: And they are experts in whatever field may be relevant.

source: སེམས་ཅན་བསམ་པ་ཤེས་གྱུར་ནས། །
en: They know the inclinations of sentient beings

source: སྙན་པའི་ཚིག་ནི་སྟོན་པར་བྱེད། །
en: And give them verses that please them.

source: ཚུལ་ཁྲིམས་ཕུང་པོ་རྣམས་སྦྱངས་ནས། །
en: “They purify the field of morality

source: བྱང་ཆུབ་དམ་པ་སངས་རྒྱས་ཏེ། །
en: And realize supreme awakening.

source: ཤིང་མཆོག་དྲུང་དུ་འདུག་བྱས་ནས། །
en: Sitting below the supreme tree,

source: སྡིག་ཅན་བདུད་ནི་སྐྲག་པར་བྱེད། །
en: They chase away the evil māras.

source: ཉི་ཟླ་དག་ནི་སྣང་བ་ལྟར། །གཟི་བརྗིད་དྲག་པོའི་འོད་བྱེད་པ། །དེ་ལྟར་སེམས་ཅན་མཆོག་འགྱུར་ཞིང་། །ཤེས་རབ་ཀྱི་ནི་མིག་ལས་བྱུང་། །
en: “Shining with an intense radiance Equal to the light of the sun and moon, They become the foremost among sentient beings, Ascending by means of the eye of wisdom.

source: སེམས་ཅན་རྣམས་ལ་ལག་བྱིན་ཏེ། །
en: “They are generous to sentient beings,

source: དྲིས་པ་ལ་ནི་ལམ་རྣམས་སྟོན། །
en: Providing answers about the path.

source: རྟག་ཏུ་གསོང་པོར་སྨྲ་འགྱུར་ཏེ། །
en: They always speak in a congenial manner

source: དེ་དག་ལ་ནི་ཕྲག་དོག་མེད། །
en: And have no envy whatsoever.

source: བདག་དང་རིན་ཆེན་གཞན་དག་ཀྱང་། །མང་པོ་རྣམས་ནི་མྱུར་དུ་གཏོང་། །
en: “They spontaneously and in abundance Give themselves and their riches to others,

source: དེ་ནི་བརྒྱ་ལམ་བྱང་ཆུབ་མཆོག །གཏོང་བར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: But not for anything Will they give up supreme awakening.

source: དད་དང་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས། །བདེན་པའི་ཚིག་ལ་རབ་ཏུ་གནས། །
en: “Their faith and morality are perfect. They have mastered words of truth,

source: ཚུལ་ཁྲིམས་ཕུང་པོ་རབ་གནས་པས། །དེ་དག་ལ་ནི་རྒྱུ་མེད་དོ། །
en: And as they are firm in their practice of morality, There will be no trickery on their part.

source: བརྫུན་ཟེར་བ་དག་འོངས་གྱུར་ནས། །སྦྱིན་ཞིང་བྱ་ཞེས་ཟེར་ཡང་ནི། །བདེན་པའི་ཚིག་ལ་གནས་པས་ན། །དད་པས་དེ་ལ་དད་པར་འགྱུར། །
en: “A liar might come their way, Saying ‘Give me this’ or ‘Do that,’ Even believing it himself, But they will recognize words of truth.

source: ཕན་ཚུན་གཅིག་ལ་གཅིག་སྨྲ་བ། །ཆོས་གོས་དང་ནི་བསོད་སྙོམས་རྣམས། །འདི་སྦྱིན་སྨྲས་ཏེ་མ་བྱིན་ཡང་། །དེ་ལ་ཡིད་ནི་འཁྲུག་པ་མེད། །
en: “If he orders everyone to give away Their robes and their alms bowls, He will not be troubled If they do not do as he says.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་ལྟར་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདུ་བྱེད་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་སྐྱེད་དོ། ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕ་མར་འདུ་ཤེས་སྐྱེད་དོ། ། འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་ཡོན་ཏན་མེད་པར་འདུ་ཤེས་སྐྱེད་དོ། ། ཚོར་བ་དང་། རྣམ་པར་རིག་པ་ལ་རྣམ་པར་རིག་པ་མེད་པར་འདུ་ཤེས་སྐྱེད་དོ། ། དེ་མཉམ་པ་དང་། མི་མཉམ་པར་ཡང་སེམས་ཀྱིས་མངོན་པར་མི་སྒྲུབ་བོ། །
en: “Moreover, Śāriputra, the bodhisatva who keeps his morality pure will view all conditioned things with distaste. He will view all sentient beings as his mother and father. He will view the pleasures of the five senses as worthless. He will view sensory experiences as telling him nothing. Neither agreeable nor disagreeable things will disturb him.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། གལ་ཏེ་སེམས་ཀྱིས་མཉམ་པར་བྱེད་ན་མྱ་ངན་ལས་འདས་པ་སེམས་ལས་འདས་པར་འགྱུར་རོ། ། སེམས་ཀྱིས་མི་མཉམ་པར་བྱེད་ན་ནི་ཆགས་པའི་སེམས་སུ་གྱུར་པས་ཆེས་མི་མཉམ་པར་འགྱུར་རོ། ། མིག་དང་གཟུགས་ལ་བརྟེན་ནས་མིག་གི་རྣམ་པར་ཤེས་པ་སྐྱེ་སྟེ། ཆགས་པའི་སེམས་བསྐྱེད་ནས་འགགས་པ་དེའི་བག་ལ་ཉལ་གྱིས་སེམས་དེའི་རང་བཞིན་དུ་སྐྱེ་སྟེ། མི་བདེན་པའི་དམིགས་པ་ལ་མི་བདེན་པའི་སེམས་སྡུག་གོ་ཞེས་རྟོག་སྟེ། དེ་ནི་ཚུལ་བཞིན་མ་ཡིན་པའོ། ། མི་སྡུག་པའོ་ཞེས་མོས་པར་བྱེད་པ་ནི་རྣམ་པར་གྲོལ་བའོ། །རྣམ་པར་གྲོལ་བ་གང་ན་བདེན་ཟད་པའོ། །ཅི་ཟད་ཅེ་ན། གང་ཟད་པ་དེ་ནི་འདོད་ཆགས་ཟད་པ། ཞེ་སྡང་ཟད་པ། གཏི་མུག་ཟད་པའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདོད་ཆགས་སྐད་ཅིག་གིས་ཟད་པར་འགྱུར་ཏེ། འདོད་ཆགས་ཀྱང་གཞན་ལ་ཟད་པ་ཡང་གཞན་ཞིག་ཡིན་དུ་ཟིན་ན་འདོད་ཆགས་ཡང་དག་པ་ཉིད་དུ་འགྱུར་རོ། ། དེ་ལྟར་འདོད་ཆགས་ཡང་དག་པ་མ་ཡིན་པས་ཟད་པར་འགྱུར་ཡང་ཤཱ་རིའི་བུ་འདོད་ཆགས་ནི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་ལས་བྱུང་བ། ཀུན་ཏུ་རྟོག་པས་ཕྱེ་བ་སྟེ། གང་ཀུན་ཏུ་མི་རྟོག་པ་དེ་ནི་མི་རྟོག་གོ ། རྟོག་པ་སྤངས་པ་ནི་ཡང་དག་པ་མ་ཡིན་པ་སྟེ། དེ་ལ་འདོད་ཆགས་བྱེད་པ་དེ་ནི་ཡང་དག་པ་མ་ཡིན་ནོ། ། གང་ཡང་དག་པ་མ་ཡིན་པ་དེ་ལ་སྡུག་བསྔལ་མེད། ཡོངས་སུ་གདུང་བ་མེད་དོ། ། གང་ཡོངས་སུ་གདུང་བ་མེད་པ་དེ་ནི་ཡང་དག་པ་མ་ཡིན་པའོ། ། གང་ཡང་དག་པ་མ་ཡིན་པ་དེ་ལ་གདུང་བ་མེད་དེ། དེ་ནི་བསིལ་བར་གྱུར་པ་མྱ་ངན་ལས་འདས་པ་ཡིན་པས་དེ་ལ་འདོད་ཆགས་མེད་དོ། །
en: “How does he do this? If one reacts to things going well, this might take one’s mind off nirvāṇa. If one reacts to things not going well, this will lead one’s mental disturbances to become even more rampant. Eye consciousness comes about in dependence on eye and form; mental attachment arises and ceases, and the dormant tendencies that it has lead one to hold the idea of a thing’s true nature. A mistaken perception leads to a mistaken idea, and one thinks, ‘It is beautiful.’ This is the mistake that is made. Approaching something thinking ‘It is not beautiful’ brings liberation. When liberation occurs, elimination occurs. What is it that is eliminated? Desire is eliminated. Anger is eliminated. Confusion is eliminated. At the same time, there is no elimination of desire, nor is there any elimination of anger or elimination of confusion. How can this be so? If when desire is eliminated that desire was considered to be something separate, then the elimination would be something other than that, and desire would be something truly real. Therefore, it is because desire has no reality that it can be eliminated.
